10/data/attachments/e7fe1ac29cb03e31.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d71527df-6a9b-4f82-8964-1eb218cb90b6</nif:username>
            <nif:friendToBeAdded>Terri_role_Friend_16982_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>